<?php


class Ru
{
    public static $bukvy = [
        0 => ['а', 1, 8, 'glas'],
        1 => ['б', 3, 2, 'soglas'],
        2 => ['в', 1, 4, 'soglas'],
        3 => ['г', 3, 2, 'soglas'],
        4 => ['д', 2, 4, 'soglas'],
        5 => ['е', 1, 9, 'glas'],
        6 => ['ж', 5, 1, 'soglas'],
        7 => ['з', 5, 2, 'soglas'],
        8 => ['и', 1, 6, 'glas'],
        9 => ['й', 4, 1, 'soglas'],
        10 => ['к', 2, 4, 'soglas'],
        11 => ['л', 2, 4, 'soglas'],
        12 => ['м', 2, 3, 'soglas'],
        13 => ['н', 1, 5, 'soglas'],
        14 => ['о', 1, 10, 'glas'],
        15 => ['п', 2, 4, 'soglas'],
        16 => ['р', 1, 5, 'soglas'],
        17 => ['с', 1, 5, 'soglas'],
        18 => ['т', 1, 5, 'soglas'],
        19 => ['у', 2, 4, 'glas'],
        20 => ['ф', 8, 1, 'soglas'],
        21 => ['х', 5, 1, 'soglas'],
        22 => ['ц', 5, 1, 'soglas'],
        23 => ['ч', 5, 1, 'soglas'],
        24 => ['ш', 8, 1, 'soglas'],
        25 => ['щ', 10, 1, 'soglas'],
        26 => ['ъ', 15, 1, false],
        27 => ['ы', 4, 2, 'glas'],
        28 => ['ь', 3, 2, 'glas'],
        29 => ['э', 8, 1, 'glas'],
        30 => ['ю', 8, 1, 'glas'],
        31 => ['я', 3, 2, 'glas'],
        32 => ['ё', 1, 0, false],
        999 => ['*', 0, 3, false]
    ];
}